In [152]:
import pandas as pd
import numpy as np

## Import the data from a website :

For each question below please have the output showing that the command worked. This will help our TA grade your homeworks faster which I am sure that he will appreciate.

Note : loading the data take a little while, so don't panic ;)

In [153]:
# URL containing the data
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/07_Visualization/Online_Retail/Online_Retail.csv'

# Read in the csv file from a website
df_retail = pd.read_csv(url, encoding = 'latin1')

# Show the first 5 entries of the dataframe
df_retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [154]:
#Checking the dimensions of our data
df_retail.shape

(541909, 8)

### 1) Change the column InvoiceNo to OrderNo and make it the indices for the dataframe. Drop the column InvoiceDate

In [155]:
#Change column InvoiceNo to OrderNo
df_retail.rename(columns={'InvoiceNo':'OrderNo'}, inplace=True)
df_retail.head(1)

,OrderNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom

### 2) Find the average amount people spent per country regardless of item, the average number of items sold per country and the total number of each item ordered.

In [156]:
#Average amount spent across all items
df_retail['Amount_Spent'] = df_retail['UnitPrice']*df_retail['Quantity']

# Average amount People Spent pert OrderNo By Country
pd.DataFrame(df_retail.groupby('Country')['Amount_Spent'].mean())

                      Amount_Spent
Country
Australia               108.877895
Austria                  25.322494
Bahrain                  28.863158
Belgium                  19.773301
Brazil                   35.737500
Canada                   24.280662
Channel Islands          26.499063
Cyprus                   20.813971
Czech Republic           23.590667
Denmark                  48.247147
EIRE                     32.122599
European Community       21.176230
Finland                  32.124806
France                   23.069288
Germany                  23.348943
Greece                   32.263836
Hong Kong                35.128611
Iceland                  23.681319
Israel                   26.625657
Italy                    21.034259
Japan                    98.716816
Lebanon                  37.641778
Lithuania                47.458857
Malta                    19.728110
Netherlands             120.059696
Norway                   32.378877
Poland                   21.152903
Portugal                 19.333127
RSA                      17.281207
Saudi Arabia             13.117000
Singapore                39.827031
Spain                    21.624390
Sweden                   79.211926
Switzerland              28.164510
USA                       5.948179
United Arab Emirates     27.974706
United Kingdom           16.525065
Unspecified              10.649753

In [157]:
# Average amount spent on all orderNo's
df_retail['Amount_Spent'].mean()

17.987794877005495

In [158]:
#Average number of items sold per country
pd.DataFrame(df_retail.groupby('Country')['Quantity'].mean())
#Commit

                       Quantity
Country
Australia             66.444003
Austria               12.037406
Bahrain               13.684211
Belgium               11.189947
Brazil                11.125000
Canada                18.298013
Channel Islands       12.505277
Cyprus                10.155949
Czech Republic        19.733333
Denmark               21.048843
EIRE                  17.403245
European Community     8.147541
Finland               15.346763
France                12.911067
Germany               12.369458
Greece                10.657534
Hong Kong             16.559028
Iceland               13.505495
Israel                14.656566
Italy                  9.961395
Japan                 70.441341
Lebanon                8.577778
Lithuania             18.628571
Malta                  7.433071
Netherlands           84.406580
Norway                17.722836
Poland                10.712610
Portugal              10.651745
RSA                    6.068966
Saudi Arabia           7.500000
Singapore             22.855895
Spain                 10.589814
Sweden                77.136364
Switzerland           15.147353
USA                    3.553265
United Arab Emirates  14.441176
United Kingdom         8.605486
Unspecified            7.399103

In [159]:
#Total number of each item sold worldwide by country
df_retail.groupby(['Country', 'StockCode'])['Quantity'].sum()

Country      StockCode
Australia    15036        600
             15056BL        3
             16161P       400
             16169E        25
             20665          6
                         ...
Unspecified  85180A         2
             85180B         1
             85212         12
             85213         12
             85227         10
Name: Quantity, Length: 19839, dtype: int64

In [160]:
# The total number of items sold by a country
df_retail.groupby(['Country'])['Quantity'].sum()

Country
Australia                 83653
Austria                    4827
Bahrain                     260
Belgium                   23152
Brazil                      356
Canada                     2763
Channel Islands            9479
Cyprus                     6317
Czech Republic              592
Denmark                    8188
EIRE                     142637
European Community          497
Finland                   10666
France                   110480
Germany                  117448
Greece                     1556
Hong Kong                  4769
Iceland                    2458
Israel                     4353
Italy                      7999
Japan                     25218
Lebanon                     386
Lithuania                   652
Malta                       944
Netherlands              200128
Norway                    19247
Poland                     3653
Portugal                  16180
RSA                         352
Saudi Arabia                 75
Singapore                  5234
Spain                     26824
Sweden                    35637
Switzerland               30325
USA                        1034
United Arab Emirates        982
United Kingdom          4263829
Unspecified                3300
Name: Quantity, dtype: int64

### 3) Remove all rows that contain any missing data, have negative values in Quantity and any rows that have products that cost 10 cents or less, then find all the items that cost 25 cents or less.

In [161]:
df_retail.shape

(541909, 9)

In [162]:
#Dropping rows with missing data
df_retail.dropna(axis=0, how='any', thresh=None, subset=None, inplace=True)
df_retail.shape

(406829, 9)

In [163]:
#Dropping rows with items costing 10 cents or less.
df_retail.drop(df_retail[df_retail['UnitPrice'] <= .10].index, inplace=True)
df_retail.shape

(406482, 9)

In [164]:
#Dropping all rows with negative quantities in Quantity column
df_retail.drop(df_retail[df_retail['Quantity'] < 0].index, inplace=True)
df_retail.shape

(397585, 9)

In [169]:
#Retrieving all the items that cost 25 cents or less. Without including the duplicate StockCodes. There are multiple different stock codes that have been sold for two different prices that are below 25 cents
df_retail[df_retail['UnitPrice'] <= .25][['StockCode','UnitPrice']].drop_duplicates(subset=None,keep='first')

       StockCode  UnitPrice
473        16237       0.21
512        16238       0.21
513        20668       0.12
730        17021       0.24
2391       17003       0.21
...          ...        ...
530393     90093       0.19
530597     84821       0.19
531827     21292       0.19
534111     84826       0.19
539863     90086       0.19

[202 rows x 2 columns]

In [166]:
# Note that there are certain items that appear twice. Because the StockeCode Sold at two different Unit prices
test = df_retail[df_retail['UnitPrice'] <= .25][['StockCode','UnitPrice']].drop_duplicates(subset=None,keep='first')
test2 = test.groupby('StockCode')['UnitPrice'].agg(list).apply(lambda l: all(map(lambda x: x==l[0], l)))
test3 = test[test['UnitPrice'].isin(test2[~test2].index)].drop_duplicates()
test3

Empty DataFrame
Columns: [StockCode, UnitPrice]
Index: []

### 4) Create two dataframes, one with the data of the United Kingdom and another with the data for France. Then merge the two using the StockCode column and add the suffixes '_UK' to the data from the UK and '_FR' to the data from France

### Please comment on the number of rows that the result has compared to the number of rows the data originally had. Why did the number of rows increase ? What needs to be changed ?

In [167]:
#Create dataframe with the data from UK


#Create dataframe with the data from France


#Merge both dataframes using StockCode to match the data

### 5) Create 3 labels : low, medium, shop-a-holic for each country based on the total number of good purchased.

In [168]:
#Bins :

#Labels :

### 6) Create a pivot table for the data.

### The table should provide the total number of products ordered for each product and every country. In other words, each product should have the associated coutries where that product was ordered and have the total number of that product that was ordered for each country.

Congratulations ! You made it to the end of the file. Your reward is a joke:

Q: What do you call a boomerang that doesn’t work?












































A: A stick.